fix: replace ascii diagrams by mermaid
